{
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "model_type": "gpt2",
    "vocab_size": 23,
    "n_positions": 1024,
    "n_ctx": 1024,
    "n_embd": 768,
    "n_layer": 12,
    "n_head": 12,
    "activation_function": "gelu_new",
    "resid_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "attn_pdrop": 0.1,
    "layer_norm_epsilon": 1e-05,
    "initializer_range": 0.02,
    "bos_token_id": 0,
    "eos_token_id": 0,
    "pad_token_id": 1,
    "unk_token_id": 2
  }